# AULA 5. 28-10 (PARTE 3)

In [10]:
import seaborn as sns

df_titanic = sns.load_dataset('titanic')
df_titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [5]:
df_titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [7]:
#Dados em falta
df_titanic.isnull().sum()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [25]:
#Sobreviveram mais homens ou mulheres

df_titanic.groupby('sex')['sex']. count() #groupby = agrupar elementos em uma lista com base em algum critério
df_titanic['sex'].value_counts()

df_titanic.groupby('sex')['survived'].sum()

sex
female    233
male      109
Name: survived, dtype: int64

In [1]:
mulheres_sobreviveram = df_titanic.groupby('sex')['survived']=='female'['sex'].sum()[0]
total_mulheres = df_titanic.groupby('sex')['survived']=='female'['sex'].count()
homens_sobreviveram = df_titanic.groupby('sex')['survived']=='male'['sex'].sum()[1]
total_homens = df_titanic.groupby('sex')['survived']=='male'['sex'].count()


print(f"mulheres: {df_titanic.groupby('sex')['survived'].sum()[0]/df_titanic.shape[0]*100:.2f}%")
print(f"homens: {df_titanic.groupby('sex')['survived'].sum()[1]/df_titanic.shape[0]*100:.2f}%")

<>:1: SyntaxWarning: str indices must be integers or slices, not str; perhaps you missed a comma?
<>:2: SyntaxWarning: str indices must be integers or slices, not str; perhaps you missed a comma?
<>:3: SyntaxWarning: str indices must be integers or slices, not str; perhaps you missed a comma?
<>:4: SyntaxWarning: str indices must be integers or slices, not str; perhaps you missed a comma?
<>:1: SyntaxWarning: str indices must be integers or slices, not str; perhaps you missed a comma?
<>:2: SyntaxWarning: str indices must be integers or slices, not str; perhaps you missed a comma?
<>:3: SyntaxWarning: str indices must be integers or slices, not str; perhaps you missed a comma?
<>:4: SyntaxWarning: str indices must be integers or slices, not str; perhaps you missed a comma?
C:\Users\carol\AppData\Local\Temp\ipykernel_13620\66077146.py:1: SyntaxWarning: str indices must be integers or slices, not str; perhaps you missed a comma?
  mulheres_sobreviveram = df_titanic.groupby('sex')['survived']=='female'['sex'].sum()[0]

NameError: name 'df_titanic' is not defined

In [51]:
#Crianças sobreviventes (<13)

print('Crianças:', df_titanic.query('age<13')['age'].count())#questiona o pandas como se fosse base de dados

print('Crianças sobreviventes:', df_titanic.query('age<13')['survived'].sum())

Crianças: 69
Crianças sobreviventes: 40

In [64]:
#Mostar a idade das 5 pessoas mais novas

#df_titanic['age'].sort_values().head()
df_titanic['age_meses'] = df_titanic['age']*12
df_titanic['age_meses'].sort_values().head()

df_titanic.sort_values(by='age_meses')[['age_meses','survived']].head()

#A pessoa mais velha sobreviveu?
df_titanic.sort_values(by='age', ascending=False)[['age','survived']].head()

      age  survived
630  80.0         1
851  74.0         0
493  71.0         0
96   71.0         0
116  70.5         0